app/views/users/show.html.erb

	<ul>
		<% @user.barbecues.each do |barbecue| %>
---
SELECT "barbecues".* FROM "barbecues" INNER JOIN "attendances" ON "barbecues"."id" = "attendances"."barbecue_id" WHERE "attendances"."user_id" = $1  [["user_id", 1]]