app/views/barbecues/index.html.erb


      <% unless current_user.barbecues.include?(bbq) %>
---
SELECT "barbecues".* FROM "barbecues" INNER JOIN "attendances" ON "barbecues"."id" = "attendances"."barbecue_id" WHERE "attendances"."user_id" = $1 AND "barbecues"."id" = $2  [["user_id", 1], ["id", 1]]