app/views/barbecues/show.html.erb

			<% @items.each do |item| %>
				<li><%= item.name %> - <a href="/users/showUser/<%= item.user_id %>"><%= User.find_by(:id => item.user_id).name %></a></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

				<!-- <ul class="list-unstyled"> -->
					<% @bbq.attendances.each do |user| %>
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."barbecue_id" = $1  [["barbecue_id", 6]]