app/controllers/barbecues_controller.rb

SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC
---
  def index

    @barbecues = Barbecue.order(:date)

SELECT "users".* FROM "users"
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @users = User.all
    @bbq = Barbecue.find_by(:id => params[:id])

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "items" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Apple"], ["created_at", "2015-07-24 16:38:46.383546"], ["updated_at", "2015-07-24 16:38:46.383546"]]
UPDATE "items" SET "barbecue_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["barbecue_id", 2], ["updated_at", "2015-07-24 16:38:46.407479"], ["id", 1]]
---
  def addItem
    bbq = Barbecue.find_by(:id => params[:id])
    user = current_user.id
    newItem = Item.create(:name => params[:itemName])
    current_user.items.push(newItem)

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 1]]
---
  def removeBBQ
    bbq = Barbecue.find_by(:id => params[:id])

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 1]]
---
  def showBBQ

    bbq = Barbecue.find_by(:id => params[:id])

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 1]]
---
  def joinBBQ

    bbq = Barbecue.find_by(:id => params[:id])

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 10]]
SELECT "comments".* FROM "comments" WHERE "comments"."barbecue_id" = $1  [["barbecue_id", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def getComments
    bbq = Barbecue.find_by(:id => params[:id])
    commentsArray = []

    bbq.comments.each do |comment|
      commentUsername = User.find_by(:id => comment.user_id).name

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "afds"], ["user_id", 1], ["created_at", "2015-07-27 05:52:43.350153"], ["updated_at", "2015-07-27 05:52:43.350153"]]
UPDATE "comments" SET "barbecue_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["barbecue_id", 1], ["updated_at", "2015-07-27 05:52:43.381581"], ["id", 2]]
---
  def addComments
    bbq = Barbecue.find_by(:id => params[:id])


    newComment = Comment.create(:content => params[:text], :user_id => current_user.id)
    bbq.comments.push(newComment)

INSERT INTO "barbecues" ("title", "venue", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Kaysser's BBQ"], ["venue", "The Man Cave"], ["date", "2015-07-29 00:00:00.000000"], ["created_at", "2015-07-24 14:10:37.242564"], ["updated_at", "2015-07-24 14:10:37.242564"]]
---
  def create
    bbq_params = params.require(:barbecue).permit(:title, :venue, :date)
    @bbq = Barbecue.new(bbq_params)

    unless @bbq.save