app/controllers/users_controller.rb

	def showUser
		@user = User.find_by(:id => params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]